{
  "_comment_strategies": "Перечень стратегий, в разрезе каждой торговой пары с привязкой к конкретной бирже.",
  "strategies": {
    "_comment_signals": "Стратегия торговли по сигналам (по заранее определённым уровням покупки и продажи с возможностью указания стоплоссов).",
    "signals": [
      {
        "_comment_id": "Уникальный идентификатор стратегии. В случае отсутствия будет сгенерирован принудительно.",
        "id": "",
        "_comment_market": "Название торговых площадок. Поддерживаются Binance, Bitfinex, Cobinhood, Huobi.",
        "market": "binance",
        "_comment_pair": "Название торговой пары, разделённые знаком -. Должны поддерживаться соответствующей биржей (market).",
        "pair": "BTC-USDT",
        "_comment_tradeCap": "Максимально допустимая сумма покупки в рамках текущей стратегии и торговой пары (pair) на бирже (market).",
        "tradeCap": 1000.1,
        "_comment_buyLevels": "Уровни покупок. Указывается цена приобретаемых монет (price) и процент покупки (percent) от общего количество средств (count). Самма процентов на всех уровнях не должна превышать 100%.",
        "buyLevels": [
          {
            "price": 7200,
            "percent": 50
          },
          {
            "price": 7000,
            "_comment_percent_0": "Уровни с нулевым процентом покупок целесообразно создавать для срабатывания сроплоссов на более низких уровнях закупки.",
            "percent": 0
          },
          {
            "price": 6900,
            "percent": 30,
            "_comment_stopLoss": "Стоплосс фиксации безубытка. Цена должна быть не ниже цены закупки на текущем уровне. Процент берётся от фактически купленных монет на текущем уровне. Стоплосс не сработает, если после покупки на текущем уровне не был достигнут следующий более высокий уровень покупок.",
            "stopLoss": {
              "price": 6950,
              "percent": 101
            }
          },
          {
            "price": 6500,
            "percent": 20
          }
        ],
        "_comment_sellLevels": "Уровни продаж. Указывается цена продоваемых монет (price) и процент продажи (percent) от общего количества купленных ранее монет. Самма процентов на всех уровнях не должна превышать 100%. Минимальная цена продажи должна быть выше максимальной цены покупки.",
        "sellLevels": [
          {
            "price": 8800,
            "percent": 10,
            "_comment_stopLoss": "Стоплосс фиксации прибыли. Цена должна быть не ниже цены продажи на текущем уровне. Процент в данном случае берётся от всех уже фактически купленных монет на всех уровнях. Стоплосс не сработает, если не был достигнут следующий уровень продаж.",
            "stopLoss": {
              "price": 9000,
              "percent": 101
            }
          },
          {
            "price": 9900,
            "_comment_percent_0": "Уровни с нулевым процентом продаж целесообразно создавать для срабатывания сроплоссов на более низких уровнях продажи.",
            "percent": 0
          },
          {
            "price": 11900,
            "percent": 30
          },
          {
            "price": 14900,
            "percent": 50
          },
          {
            "price": 17000,
            "percent": 10.1
          }
        ],
        "_comment_stopLoss": "Стоплосс фиксации убытка. Цена должна быть ниже минимальной цены закупки. Процент продаваемых по стоплоссу моент не должен превышать 100%",
        "stopLoss": {
          "price": 5999,
          "percent": 50
        }
      }
    ]
  }
}